dbbench-result/200mbwise.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    200000000
RawSize:    22125.2 MB (estimated)
FileSize:   12588.5 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
fillrandom   :       8.388 micros/op;   13.2 MB/s;  1677.553
readrandom   :       7.280 micros/op;   15.2 MB/s (200000000 of 200000000 found);  1455.909
--------------------------------------------------
memtable stall time: 1.51717 s
L0 stall time: 0  s
L0 slow stall time: 1228.93  s
waf:17.9793