dbbench-result/leveldb20m.txt
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    20000000
RawSize:    2212.5 MB (estimated)
FileSize:   1258.9 MB (estimated)
------------------------------------------------
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
fillrandom   :       8.900 micros/op;   12.4 MB/s;   177.995
readrandom   :       4.589 micros/op;   24.1 MB/s (20000000 of 20000000 found);    91.786
--------------------------------------------------
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 140.14  s
waf:14.6502
Timer 0: 5036517888 : 5.036517888
Timer 1: 2212696576 : 2.212696576
Timer 2: 9259606016 : 9.259606016
Timer 3: 17205686272 : 17.205686272
Timer 4: 0 : 0.000000000
Timer 5: 6470776320 : 6.470776320
Timer 6: 35459100672 : 35.459100672
Timer 7: 183828185088 : 183.828185088
Timer 8: 0 : 0.000000000
Timer 9: 0 : 0.000000000
Timer 10: 0 : 0.000000000
Timer 11: 0 : 0.000000000
Timer 12: 0 : 0.000000000
Timer 13: 0 : 0.000000000
Timer 14: 9908584448 : 9.908584448
Timer 15: 395353504 : 0.395353504
Timer 16: 13597501440 : 13.597501440
Timer 17: 0 : 0.000000000
Timer 18: 0 : 0.000000000
Timer 19: 0 : 0.000000000

                               Compactions
Level  Files  Size(MB) Time(sec) M_Time(micros) Read(MB) Write(MB)  M_Read(MB) M_Write(MB) Count 
------------------------------------------------------------------------------------------------ 
  0         1         3       41         0        4098       6512          0          0       89
  1         5         8       73     95793       10490      10329         12         12     1200
  2        71        99       53     72721        7544       6913         11         12      947
  3       510      1000        0         0           0          0          0          0        0
  4       263       510        0         0           0          0          0          0        0

Counter LevelModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FileModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Baseline 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Succeeded 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseInternal 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Compaction -2147483648 31403023552 91227648736 59842851328 1354579968 0 0 0 0
2714 89 1240 1122 263 0 0 0 0
Counter Learn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter SuccessTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FilteredLookup 752631808 238190592 77529088 157990912 183402496 95518720 0 0 0
55836850 19960708 6274359 11429589 12011756 6160438 0 0 0
Counter PutWait 133012 133012 0 0 0 0 0 0 0
133012 133012 0 0 0 0 0 0 0
Counter FileLearning 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelLearn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelUse 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelNotUse 64004153 0 19905024 19766497 18172194 6160438 0 0 0
64004153 0 19905024 19766497 18172194 6160438 0 0 0